app/views/posts/hello.html.erb

SELECT `posts`.* FROM `posts`
---
<% Post.all.each do|post|%>