app/controllers/application_controller.rb

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2022-08-10 08:32:05.560414', '2022-08-10 08:32:05.560414')
---
  def current_cart
    if session[:cart_id]
      cart = Cart.find_by(id: session[:cart_id])
      if cart.present?
        @current_cart = cart
      else
        session[:cart_id] = nil
      end
    end

    if session[:cart_id].nil?
      @current_cart = Cart.create