app/controllers/natures_controller.rb

SELECT `natures`.* FROM `natures`
---
  def index
    @natures = Nature.all

INSERT INTO `natures` (`name`, `description`, `category`, `price`, `image`, `created_at`, `updated_at`) VALUES ('', 'sguhijkm', 'tryghjnm', 14, 'https://floweraura-blog-img.s3.ap-south-1.amazonaws.com/Plant+Dec+2019-+Dec+2020/fortunate-money-plant.jpg', '2022-08-09 12:07:45.546671', '2022-08-09 12:07:45.546671')
---
  def create
    @nature = Nature.new(nature_params)

    respond_to do |format|
      if @nature.save

UPDATE `natures` SET `natures`.`name` = 'rose', `natures`.`price` = 387, `natures`.`image` = 'https://nationaltoday.com/wp-content/uploads/2021/05/Rose.jpg', `natures`.`updated_at` = '2022-07-27 09:40:30.574261' WHERE `natures`.`id` = 1
---
  def update
    respond_to do |format|
      if @nature.update(nature_params)

SELECT `natures`.* FROM `natures` WHERE `natures`.`id` = 1 LIMIT 1
---
  def set_nature
    @nature = Nature.find(params[:id])