app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    @posts = Post.all

INSERT INTO `posts` (`Title`, `Content`, `Image`, `created_at`, `updated_at`) VALUES ('', '', '', '2022-08-08 10:03:07.834380', '2022-08-08 10:03:07.834380')
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('', 'Hello', '2022-08-09 07:22:13.386093', '2022-08-09 07:22:13.386093')
---
  def create
    @post = Post.new(post_params)
    @post.header_image.attach(post_params[:header_image])
    @post.files.attach(post_params[:files])
    respond_to do |format|
      if @post.save

UPDATE `posts` SET `posts`.`Title` = 'Dancing', `posts`.`updated_at` = '2022-08-08 12:40:42.400854' WHERE `posts`.`id` = 4
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM `posts` WHERE `posts`.`id` = 1
---
  def destroy
    @post.destroy

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
---
    def set_post
      @post = Post.find(params[:id])